app/controllers/books_controller.rb

  def index
    @books = Book.includes(:author, :genre)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8)  [["id", 5], ["id", 8], ["id", 10], ["id", 6], ["id", 4], ["id", 9], ["id", 3], ["id", 7]]
SELECT "books".* FROM "books"
SELECT "genres".* FROM "genres" WHERE "genres"."id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20)

  def new
    @book = Book.new
    @authors = Author.all
    @genres = Genre.all
---
SELECT "authors".* FROM "authors"
SELECT "genres".* FROM "genres"

  def edit
    @book = Book.find(params[:id])
    @authors = Author.all
    @genres = Genre.all
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "authors".* FROM "authors"
SELECT "genres".* FROM "genres"